[{
    "id": "0282e0e58a5c404fbd15261f11c2ab6a",
    "course_id": "01",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "course_enroled": 488,
    "title": " Introduction to Computer Science",
    "tutor": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://i.ibb.co/Hgz0bXJ/Introduction-to-Computer-Science.jpgg",
    "details": "Introduction to the use of computer hardware and software as tools for solving problems. Automated input devices and output methods (including pre-printed stationary and turnaround documents) as part of the solution. Using personal computers as effective problem solving tools for the present and the future. Theory behind solving problems using common application software including word processing, spreadsheets, database management, and electronic communications. Problem solving using the Internet and the World Wide Web. Programming principles and use of macros to support the understanding of application software. The course includes a compulsory 3 hour laboratory work each week."
  },
  {
    "id": "0282e0e58a5c404fbd15261f11c2ab6b",
    "course_id": "02",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "course_enroled": 488,
    "title": " Programming Language I - C",
    "tutor": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://i.ibb.co/St6fGhW/Programming-Language-I.jpg",
    "details": "Introduction to the use of computer hardware and software as tools for solving problems. Automated input devices and output methods (including pre-printed stationary and turnaround documents) as part of the solution. Using personal computers as effective problem solving tools for the present and the future. Theory behind solving problems using common application software including word processing, spreadsheets, database management, and electronic communications. Problem solving using the Internet and the World Wide Web. Programming principles and use of macros to support the understanding of application software. The course includes a compulsory 3 hour laboratory work each week."
  },
{
    "id": "0282e0e58a5c404fbd22261f11b2ab6a",
    "course_id": "03",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "course_enroled": 488,
    "title": " Programming Language II - C++",
    "tutor": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://i.ibb.co/b3Gvjb5/6038586442907648.png",
    "details": "This course would be an introduction to data structures, formal specification of syntax, elements of language theory and mathematical preliminaries. Other topics that would be covered are formal languages, structured programming concepts, survey of features of existing high level languages. Students would design and write application using an appropriate language.The course includes a compulsory 3 hour laboratory work each week."
  },
{
    "id": "0282e0e58a5c404fbd22261f11b2cd7f",
    "course_id": "04",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "course_enroled": 488,
    "title": " Data Structures",
    "tutor": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://i.ibb.co/71q2mFH/word-cloud-data-structure-vector-8561627.jpg",
    "details": "Introduction to widely used and effective methods of data organisation, focussing on data structures, their algorithms and the performance of these algorithms. Concepts and examples, elementary data objects, elementary data structures, arrays, lists, stacks, queues, graphs, trees, compound structures, data abstraction and primitive operations on these structures. memory management; sorting and searching; hash techniques; Introduction to the fundamental algorithms and data structures: recursion, backtrack search, lists, stacks, queues, trees, operation on sets, priority queues, graph dictionary. Introduction to the analysis of algorithms to process the basic structures. A brief introduction to database systems and the analysis of data structure performance and use in these systems. The course includes a compulsory 3 hour laboratory work alternate week."
  },
{
    "id": "0282e0e58a5c404fbd22261f11b5ls9r",
    "course_id": "05",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "course_enroled": 488,
    "title": "Algorithms ",
    "tutor": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://i.ibb.co/WzTrBSk/Algorithms.png",
    "details": "The study of efficient algorithms and effective algorithm design techniques. Techniques for analysis of algorithms, Methods for the design of efficient algorithms :Divide and Conquer paradigm, Greedy method, Dynamic programming, Backtracking, Basic search and traversal techniques, Graph algorithms, Elementary parallel algorithms, Algebraic simplification and transformations, Lower bound theory, NP-hard and NP-complete problems. Techniques for the design and analysis of efficient algorithms, Emphasising methods useful in practice. sorting; Data structures for sets: Heaps, Hashing; Graph algorithms: Shortest paths, Depth-first search, Network flow, Computational geometry; Integer arithmetic: gcd, primality; polynomial and matrix calculations; amortised analysis; Performance bounds, asymptotic and analysis, worst case and average case behaviour, correctness and complexity. Particular classes of algorithms such as sorting and searching are studied in detail. The course includes a compulsory 3 hour laboratory work alternate week."
  },
{
    "id": "0282e0e58a5c404fbd22261f11b5llo1w",
    "course_id": "06",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "course_enroled": 488,
    "title": "Data Communications ",
    "tutor": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://i.ibb.co/PQtqGFH/Data-Communications.png",
    "details": "Introduction to purpose and methods of communication. Necessity for modulation and techniques. Technical aspects of data communications. Effects of noise and control. Basic concepts such as fundamental limits, encoding, modulation, multiplexing, error detection and control. Topics include: Data Transmission Protocols, different layers in data communication systems, LANs, WANs linked with telephony. This course will include a compulsory 3-hour laboratory work each week for those interested in obtaining the CCNA certification."
  },
{
    "id": "0282e0e58a5c404fbd22261f11b5llgg4g",
    "course_id": "07",
    "rating": { "number": 4.5, "badge": "Excellent" },
    "course_enroled": 488,
    "title": " Operating Systems",
    "tutor": {
      "name": "Jimmy Dane",
      "published_date": "2022-08-24 17:27:34",
      "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
    },
    "image_url": "https://i.ibb.co/FzF11mV/Operating-Systems.jpg",
    "details": "Principles of operating systems: design objects; sequential process; concurrent processes, functional mutual exclusion, processor co-operation and deadlocks, management. Control and scheduling of large information processing systems. Dispatching processor access methods, job control languages memory addressing, paging and store multiplexing, and time sharing, batch processing. Scheduling algorithms, file systems, and security; semaphores and critical sections, device drivers, multiprocessing, sharing, design and implementation methodology, performance evaluation and case studies. The course includes a compulsory 3 hour laboratory work each week."
  }

]